Repository: ahmedgalal007/dotnet-webapi-boilerplate
Catalog: src/Host/Localization/*/Application.*.po
Languages: ar

# FSH.WebApi.Application.Catalog.Brands.CreateBrandRequestValidator
source: Brand {0} already Exists.
ar: العلامة التجارية {0} موجودة بالفعل.

# FSH.WebApi.Application.Catalog.Brands.DeleteBrandRequestHandler
source: Brand cannot be deleted as it's being used.
ar: العلامة التجارية {0} لا يمكن إزالتها لانها مستخدمة بالفعل.

# FSH.WebApi.Application.Catalog.Brands.DeleteBrandRequestHandler
source: Brand {0} Not Found.
ar: العلامة التجارية {0} غبر موجودة.

# FSH.WebApi.Application.Catalog.Brands.GetBrandRequestHandler
source: Brand {0} Not Found.
ar: العلامة التجارية {0} غبر موجودة.

# FSH.WebApi.Application.Catalog.Brands.UpdateBrandRequestValidator
source: Brand {0} already Exists.
ar: العلامة التجارية {0} موجودة بالفعل.

# FSH.WebApi.Application.Catalog.Brands.UpdateBrandRequestHandler
source: Brand {0} Not Found.
ar: العلامة التجارية {0} غبر موجودة.

# FSH.WebApi.Application.Catalog.Products.CreateProductRequestValidator
source: Product {0} already Exists.
ar: المنتج {0} موجود بالفعل.

# FSH.WebApi.Application.Catalog.Products.CreateProductRequestValidator
source: Brand {0} Not Found.
ar: العلامة التجارية {0} غبر موجودة.

# FSH.WebApi.Application.Catalog.Products.DeleteProductRequestHandler
source: Product {0} Not Found.
ar: المنتج {0} غبر موجود.

# FSH.WebApi.Application.Catalog.Products.GetProductRequestHandler
source: Product {0} Not Found.
ar: المنتج {0} غبر موجود.

# FSH.WebApi.Application.Catalog.Products.GetProductViaDapperRequestHandler
source: Product {0} Not Found.
ar: المنتج {0} غبر موجود.

# FSH.WebApi.Application.Catalog.Products.UpdateProductRequestHandler
source: Product {0} Not Found.
ar: المنتج {0} غبر موجود.

# FSH.WebApi.Application.Catalog.Products.UpdateProductRequestValidator
source: Product {0} already Exists.
ar: المنتج {0} موجود بالفعل.

# FSH.WebApi.Application.Catalog.Products.UpdateProductRequestValidator
source: Brand {0} Not Found.
ar: المنتج {0} غبر موجود.

# FSH.WebApi.Application.Common.FileStorage.FileUploadRequestValidator
source: Image Name cannot be empty!
ar: أسم الصورة لا يجب أن يكون خالي !

# FSH.WebApi.Application.Common.FileStorage.FileUploadRequestValidator
source: Image Extension cannot be empty!
ar: إمتداد الصورة لا يجب أن يكون خالي !

# FSH.WebApi.Application.Common.FileStorage.FileUploadRequestValidator
source: Image Data cannot be empty!
ar: ملف الصورة لا يجب أن يكون خالي !

# FSH.WebApi.Application.Dashboard.GetStatsRequestHandler
source: Products
ar: المنتجات

# FSH.WebApi.Application.Dashboard.GetStatsRequestHandler
source: Brands
ar: العلامات التجارية

# FSH.WebApi.Application.Identity.Roles.CreateOrUpdateRoleRequestValidator
source: Similar Role already exists.
ar: دور مماثل موجود بالفعل.

# FSH.WebApi.Application.Identity.Tokens.TokenRequestValidator
source: Invalid Email Address.
ar: عنوان البريد الإلكتروني غير صالح.

# FSH.WebApi.Application.Identity.Users.CreateUserRequestValidator
source: Invalid Email Address.
ar: عنوان البريد الإلكتروني غير صالح.

# FSH.WebApi.Application.Identity.Users.CreateUserRequestValidator
source: Email {0} is already registered.
ar: البريد الإلكتروني {0} مسجل بالفعل.

# FSH.WebApi.Application.Identity.Users.CreateUserRequestValidator
source: Username {0} is already taken.
ar: اسم المستخدم {0} مأخوذ بالفعل.

# FSH.WebApi.Application.Identity.Users.CreateUserRequestValidator
source: Phone number {0} is already registered.
ar: رقم الهاتف {0} مسجل بالفعل.

# FSH.WebApi.Application.Identity.Users.Password.ChangePasswordRequestValidator
source: Passwords do not match.
ar: كلمة المرور غير مطابقة.

# FSH.WebApi.Application.Identity.Users.Password.ForgotPasswordRequestValidator
source: Invalid Email Address.
ar: عنوان البريد الإلكتروني غير صالح.

# FSH.WebApi.Application.Identity.Users.UpdateUserRequestValidator
source: Invalid Email Address.
ar: عنوان البريد الإلكتروني غير صالح.

# FSH.WebApi.Application.Identity.Users.UpdateUserRequestValidator
source: Email {0} is already registered.
ar: البريد الإلكتروني {0} مسجل بالفعل.

# FSH.WebApi.Application.Identity.Users.UpdateUserRequestValidator
source: Phone number {0} is already registered.
ar: رقم الهاتف {0} مسجل بالفعل.

# FSH.WebApi.Application.Multitenancy.CreateTenantRequestValidator
source: Tenant {0} already exists.
ar: المستأجر {0} موجود بالفعل.

# FSH.WebApi.Application.Multitenancy.CreateTenantRequestValidator
source: Connection string invalid.
ar: سلسلة الاتصال غير صالحة.
